{
  "Jateng": [
    {
      "id": 1,
      "title": "Tahu Petis",
      "image": "https://www.gotravelly.com/blog/wp-content/uploads/2018/04/makanan-khas-jawa-tengah-tahu-petis.jpg",
      "bahan": "6 potong tahu putih goreng, bawang putih 5 siung dihaluskan, cabai merah 2 buah dihaluskan, serai 2 batang dimemarkan, petis 100 gram, garam 1/2 sdt, gula 1/2 sdt, air 50 ml, minyak untuk menumis secukupnya",
      "desc": "Langkah pertama, panaskan sedikit minyak. Tumis bawang putih, cabai, dan serai hingga harum. Langkah kedua, tuang petis dan air. Aduk rata hingga tidak ada petis menggumpal dan biarkan hingga mendidih. Koreksi rasanya. Langkah ketiga, bumbui dengan garam dan gula. Aduk rata lalu angkat. Langkah terakhir, belah bagian tengah tahu tapi jangan sampai putus. Isi bagian tengahnya dengan saus petis."
    },
    {
      "id": 2,
      "title": "Tempe Mendoan",
      "image": "https://www.gotravelly.com/blog/wp-content/uploads/2018/04/tempe-mendoan.jpg",
      "bahan": "1 papan tempe diiris tipis, 200 gr terigu, 4 siung bawang merah, 2 siung bawang putih, 3 buah cabe rawit, 5 buah cabe merah, 1 ruas kencur, 2 batang daun bawang yang sudah diiris, 1/2 sdt ketumbar, garam dan merica secukupnya.",
      "desc": "Langkah pertama, haluskan semua bumbu seperti bawang putih, bawang merah, ketumbar dan kunyit serta tambahkan sedikit air. Langkah kedua, campurkan tepung terigu, garam dan lada sampai merata. Setelah itu, tambahkan dengan bumbu halus tadi, daun bawang, ketumbar tumbuh dan air. Langkah ketiga, Celupkan tempe dalam larutan tepung pelapis, lalu goreng dalam minyak panas hingga tingkat kematangan yang diinginkan. Langkah terakhir, angkat tempe dan tiriskan."
    },
    {
      "id": 3,
      "title": "Nasi Gandul",
      "image": "https://www.gotravelly.com/blog/wp-content/uploads/2018/04/makanan-khas-jawa-tengah-nasi-gandul.jpg",
      "bahan": "Daging sapi 500 gram, garam 1 sdt, daun salam 2 lembar, sereh 1 batang digeprek, daun jeruk 5 lembar, lengkuas 3 cm digeprek, kayu manis 5 cm, kecap manis 3 sdm, santan 250 ml, bawang merah 5 butir, bawang putih 4 siung, kemiri 5 butir disangrai, ketumbar 1 sdm disangrai, jahe 2 cm, jinten 1/2 sdt, kencur 1 cm, pala bubuk 1/2 sdt, gula pasir 1 sdm, garam 1 sdt, dan merica 1/4 sdt",
      "desc": "Langkah pertama, rebus daging sampai empuk. Kemudian potong kotak. Langkah kedua, tumis bumbu halus, daun salam, sereh, kayu manis, lengkuas dan daun jeruk sampai harum. Lalu masukkan ke rebusan daging. Langkah ketiga, Masukan juga santan dan kecap manis. Masak sampai kuah mengental. Langkah terakhir, sajikan dengan nasi dan bawang goreng."
    },
    {
      "id": 4,
      "title": "Dawet Ireng",
      "image": "https://www.gotravelly.com/blog/wp-content/uploads/2018/04/dawet-ireng.jpg",
      "bahan": "75 g tepung beras, 60 g tepung kanji, 2-3 sdm abu merang/charcoal powder campur dengan sedikit air, 1 gram garam, 1000 ml air, 300 gram gula merah disisir halus, 4 lembar daun pandan dipotong-potong, dan 600 ml santan sedang",
      "desc": "Langkah pertama, masukkan bahan-bahan untuk membuat dawet ireng: tepung beras, tepung kanji, larutan abu merang, garam, dan air kedalam panci. Nyalakan kompor. Masak sambil diaduk-aduk hingga menjadi adonan yang kental lalu diangkat. Langkah kedua, masukkan adonan dawet ireng ke dalam cetakan cendol. Tekan cetakan cendol dan tampung adonan dawet ireng yang menetes ke bawah dalam wadah berisi air es. Setelah itu, tiriskan dan sisihkan. Langkah ketiga, masukkan bahan-bahan untuk membuat sirup gula merah ke dalam panci. Masak dengan dengan kecil hingga mendidih. Jika gula merah sudah larut dan kental, angkat lalu dinginkan. Langkah keempat, masukkan bahan-bahan untuk membuat kuah santan ke dalam panci. Aduk-aduk dan rebus hingga mendidih. Jika sudah angkat lalu dinginkan. Langkah terakhir, masukkan dawet irang secukupnya dalam mangkok atau gelas saji, tambahkan sirup gula merah lalu siram kuah santan. Setelah itu kamu bisa tambahkan es batu sesuai selera."
    },
    {
      "id": 5,
      "title": "Brekecek",
      "image": "https://www.gotravelly.com/blog/wp-content/uploads/2018/04/makanan-khas-jawa-tengah-brekecek.jpg",
      "bahan": "3 kepala ikan jahan segar, 3 batang serai, 2 lembar daun salam, 2 lembar daun jeruk, daun kemangi, 1 buah tomat muda, minyak goreng secukupnya, air secukupnya, gula dan garam secukupnya, 8 siung bawang merah, 4 siung bawang putih, 1 sdm ketumbar, 4 butir kemiri, 1 ruas lengkuas, 1 ruas jahe, 1 ruas kunyit, cabai merah, merica secukupnya",
      "desc": "Langkah pertama, cuci kepala pathak jahan hingga bersih dan haluskan semua bumbu-bumbu. Langkah kedua, tumis bumbu halus ke dalam minyak goreng secukupnya hingga tercium bau harum. Lalu beri air secukupnya ke dalam tumisan bumbu, lalu aduk perlahan hingga mendidih. Langkah ketiga, masukkan kepala ikan jahan ke dalam kuah bumbu yang telah mendidih lalu masukkan bumbu pelengkap berupa daun salam, lengkuas, serai, daun jeruk, daun kemangi, dan irisan tomat muda. Langkah terakhir, tambahkan gula dan garam secukupnya dan diaduk-aduk agar bumbu merata."
    },
    {
      "id": 6,
      "title": "Nasi Grombyang",
      "image": "https://www.gotravelly.com/blog/wp-content/uploads/2018/04/nasi-grombyang.jpg",
      "bahan": "50 gram kelapa setengah tua dikupas dan parut kasar, 500 gram daging sandung lamur dipotong dadu 2 cm, 3 sdm tauco, 2 lembar daun salam, 3 batang serai dimemarkan,  1 1/2 liter air untuk merebus, 5 sdm bawang goreng , 4 porsi nasi putih, 6 butir bawang merah, 3 siung bawang putih, daging dari 4 buah kluek,  1 sdm garam, dan 3 sdt gula merah.",
      "desc": "Langkah pertama, sangrai kelapa parut hingga kecoklatan, lalu disisihkan. Rebus daging bersama tauco, daun salam, serai, hingga bumbu halus. Masak sampai bumbu meresap dan daging lunak, lalu diangkat. Setelah itu, sajikan nasi dalam piring bersama campuran daging, taburi dengan bawang goreng."
    },
    {
      "id": 7,
      "title": "Garang Asem",
      "image": "https://www.gotravelly.com/blog/wp-content/uploads/2018/04/makanan-khas-jawa-tengah-garam-asem.jpg",
      "bahan": "Ayam kampung 1/2 ekor, perasan santan pertama dari 1/2 butir kelapa 250 ml, perasan santan encer berikutnya dari 1/2 butir kelapa 750 ml, lengkuas dimemarkan 3 cm, daun salam disobek jadi 5 bagian, 2 lembar daun jeruk disobek jadi 5 bagian, 2 lembar serai diambil putihnya dan memarkan 2 batang, garam 1 sdm ,gula 1/2 sdm, daun pisang untuk membungkus secukupnya, bawang merah 12 siung, bawang putih 8 siung, belimbing wuluh 5 buah, tomat hijau 4 buah, rawit merah, biarkan utuh 6 cabai, lengkuas muda diiris tipis 5 cm, daun salam dirobek-robek 3 lembar, dan daun jeruk dirobek-robek 4 lembar",
      "desc": "Langkah pertama, cuci bersih ayam, potong-potong menjadi beberapa bagian kecil. Sisihkan. Langkah kedua, rebus santan encer bersama daun salam, daun jeruk, lengkuas, serai, garam, dan gula. Langkah ketiga, masukkan ayam. Masak hingga ayam empuk dan air menyusut. Langkah keempat, apabila ayam belum empuk, bisa ditambahkan air dan masak kembali hingga empuk. Langkah kelima, tuang santan kental. Masak sambil diaduk perlahan hingga mendidih dan santan meresap ke ayam. Angkat ayam dan bagi menjadi 5 bagian. Sisihkan. Langkah keenam, siapkan bumbu iris, campur menjadi satu dalam wadah. Bagi menjadi 5 bagian. Sisihkan. Langkah ketujuh, ambil 2 lembar daun pisang, susun dan tumpuk jadi satu. Langkah kedelapan, taruh bumbu rempah: daun salam, daun jeruk, dan irisan lengkuas. Taruh di atasnya 1 bagian ayam. Tambahkan bumbu iris 1 bagian. Siram dengan kuah santan rebusan ayam. Langkah kesembilan, bungkus rapi lalu sematkan atasnya dengan tusuk gigi. Langkah terakhir, kukus garang asem selama kurang lebih 30 menit. Angkat. Siap disajikan."
    },
    {
      "id": 8,
      "title": "Getuk Goreng",
      "image": "https://www.gotravelly.com/blog/wp-content/uploads/2018/04/getuk-goreng.jpg",
      "bahan": "Singkong 600 gram dikupas, gula merah 250 gram disisir halus, santan matang 50 ml (opsional), garam 1 sdt, vanili 1 sdt, minyak untuk menggoreng secukupnya, tepung beras 2 sdm, maizena 1 sdm, dan air 100 ml",
      "desc": "Langkah pertama, kukus singkong hingga matang. Angkat dan haluskan selagi hangat. Langkah kedua, campurkan adonan singkong yang sudah halus dengan gula merah, garam, dan vanili di dalam wadah. Uleni hingga rata. Langkah ketiga, tuangkan santan. Lanjutkan uleni hingga tercampur rata. Diamkan selama 15 menit. Campur gula merah, garam, vanili ke adonan singkong yang sudah halus. Uleni rata. Tambahkan santan dan uleni lagi hingga tercampur rata. Diamkan 15 menit. Langkah keempat, campurkan semua bahan pencelup di dalam wadah lalu aduk rata. Sisihkan. Lalu panaskan banyak minyak di dalam wajan. Langkah kelima, ambil sedikit adonan getuk lalu asal bulat-bulatkan (tidak perlu rapi dan berukuran sama). Celupkan dalam adonan pencelup, lalu goreng dalam minyak panas. Lakukan hingga adonan habis. Langkah terakhir, goreng hingga kuning kecoklatan. Angkat dan tiriskan."
    }
  ],
  "profile": {
    "name": "typicode"
  }
}
